In [1]:
import pandas as pd
import numpy as np

In [4]:
student_ages=pd.Series([22,24,20]) #series 1
teacher_ages=pd.Series([40,50,45])#series 2
combine = pd.DataFrame([student_ages, teacher_ages]) # Data Frame
combine.columns = ["Class-1", "Class-2", "Class-3"] # naming columns
combine

   Class-1  Class-2  Class-3
0       22       24       20
1       40       50       45

In [7]:
combine = pd.DataFrame({"Class-1":[22, 40], "Class-2":[24, 50], "Class-3":[20, 45]})
combine

   Class-1  Class-2  Class-3
0       22       24       20
1       40       50       45

In [9]:
number = pd.DataFrame(np.arange(1, 11).reshape(2, 5))
number

   0  1  2  3   4
0  1  2  3  4   5
1  6  7  8  9  10

In [11]:
combine = pd.DataFrame([(22, 24, 20), (40,50,45)], columns=['Class-1', 'Class-2', 'Class-3'])
combine

   Class-1  Class-2  Class-3
0       22       24       20
1       40       50       45